STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_Thermostat_Server_Router_OTA/STM32_WPAN/App/app_zigbee_endpoint.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : app_zigbee_endpoint.c
  * Description        : Zigbee Application to manage endpoints and these clusters.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <assert.h>
#include <stdint.h>

#include "app_common.h"
#include "app_conf.h"
#include "log_module.h"
#include "app_entry.h"
#include "app_zigbee.h"
#include "app_zigbee_ota_defines.h"
#include "dbg_trace.h"
#include "ieee802154_enums.h"
#include "mcp_enums.h"

#include "stm32_lpm.h"
#include "stm32_rtos.h"
#include "stm32_timer.h"
#include "stm32_lpm_if.h"

#include "zigbee.h"
#include "zigbee.nwk.h"
#include "zigbee.security.h"

/* Private includes -----------------------------------------------------------*/
#include "zcl/zcl.h"
#include "zcl/general/zcl.therm.h"

/* USER CODE BEGIN PI */
#include "app_bsp.h"
#include "app_menu.h"

/* Used to simulate a Temperature Sensor */
#include "zigbee_plat.h"

/* USER CODE END PI */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_CHANNEL                14u
#define APP_ZIGBEE_CHANNEL_MASK           ( 1u << APP_ZIGBEE_CHANNEL )
#define APP_ZIGBEE_TX_POWER               ((int8_t) 10)    /* TX-Power is at +10 dBm. */

#define APP_ZIGBEE_ENDPOINT               17u
#define APP_ZIGBEE_PROFILE_ID             ZCL_PROFILE_HOME_AUTOMATION
#define APP_ZIGBEE_DEVICE_ID              ZCL_DEVICE_THERMOSTAT
#define APP_ZIGBEE_GROUP_ADDRESS          0x0001u

#define APP_ZIGBEE_CLUSTER_ID             ZCL_CLUSTER_HVAC_THERMOSTAT
#define APP_ZIGBEE_CLUSTER_NAME           "Thermostat Server"

#define FUOTA_ENDPOINT                    1u
#define FUOTA_PROFILE_ID                  ZCL_PROFILE_HOME_AUTOMATION
#define FUOTA_DEVICE_ID                   ZCL_DEVICE_THERMOSTAT

#define FUOTA_CLUSTER_ID                  ZCL_CLUSTER_OTA_UPGRADE
#define FUOTA_CLUSTER_NAME                "OTA Client"

/* USER CODE BEGIN PD */
#define APP_ZIGBEE_STARTUP_FAIL_DELAY     500u

/* Temperature Measures */
#define TEMP_MEASURED_MIN                 (int16_t)0xF060   /* Sensor limit : -40 degrees Celsius   */
#define TEMP_MEASURED_DEFAULT             (int16_t)0x09C4   /* Default Temp : +25 degrees Celsius   */
#define TEMP_MEASURED_MAX                 (int16_t)0x30d4   /* Sensor limit : +125 degrees Celsius  */
#define TEMP_TOLERANCE                    (int16_t)0x0032   /* Temp tolerance : +/-0.5 degrees Celsius */
#define TEMP_DISPLAY_SCALE                (int16_t)100u     /* Temperature Display divider */
#define TEMP_INERTIA                      10u               /* Temperature echange every 10 secs */

/* Temperature Simulation */
#define TEMP_SIMU_START_DEFAULT           TEMP_MEASURED_DEFAULT
#define TEMP_SIMU_INCREMENT               (int16_t)0x000A   /* Temp Simutation change : +/-0.1 degrees Celsius */

/* Relay State (On/Off) & Play (Cooling/Heating) */
#define RELAY_STATE_OPEN                  0x00u
#define RELAY_STATE_CLOSE                 0x01u

#define RELAY_NO_PLAY                     0x00u
#define RELAY_PLAY_HEATING                0x01u
#define RELAY_PLAY_COOLING                0x02u

//#define TEMP_SENSOR_UPDATE_PERIOD         500u              /* 500 ms */
#define TEMP_SENSOR_UPDATE_PERIOD         5000u              /* 5 s */

/* Tmperature for menu */
#define MENU_TEMP_MIN                     (int16_t)( TEMP_MEASURED_MIN / 100 ) 
#define MENU_TEMP_MAX                     (int16_t)( TEMP_MEASURED_MAX / 100 )
#define MENU_TIME_TO_CHOICE_TIMEOUT       (uint32_t)( 10u * 1000u )    /* 10 seconds */

#define APP_ZIGBEE_APPLICATION_NAME       APP_ZIGBEE_CLUSTER_NAME
#define APP_ZIGBEE_APPLICATION_OS_NAME    "."

// -- Redefine tasks & priorities to better code read --
#define CFG_TASK_ZIGBEE_APP_SENSOR_READ   CFG_TASK_ZIGBEE_APP1
#define CFG_TASK_ZIGBEE_APP_MENU_UPDATE   CFG_TASK_ZIGBEE_APP2

#define TASK_ZIGBEE_APP_SENSOR_READ_PRIORITY  CFG_SEQ_PRIO_1
#define TASK_ZIGBEE_APP_MENU_UPDATE_PRIORITY  CFG_SEQ_PRIO_1

/* USER CODE END PD */

// -- Redefine Clusters to better code read --
#define ThermostatServer                  pstZbCluster[0]

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private constants ---------------------------------------------------------*/
/* OTA Client Information about Certificate (if used) */
/* To obtains these keys, you need to create an account on Certicom site (www.certicom.com). */
#define   CA_PUB_KEY_SIZE       ( 37u )

const uint8_t szCAPubKey[CA_PUB_KEY_SIZE] =
{
  0,
};

PLACE_IN_SECTION("TAG_OTA_END") const uint32_t lMagicKeywordValue = FUOTA_MAGIC_KEYWORD_END_APPLI;
PLACE_IN_SECTION("TAG_OTA_INFO") const AppZbOta_ClientInfo_st stOtaClientInfo =
{
  /* OTA Client Information about this Firmware */
  .lFwEndMagicKeyAddress  = (uint32_t)&lMagicKeywordValue,
  .lBaseAddress           = FUOTA_APP_DOWNLOAD_BINARY_ADDRESS,
  .lOtaTagOffset          = FUOTA_APP_FW_TAG_OFFSET,
  .lOtaTagMagicKeyword    = FUOTA_MAGIC_KEYWORD_TAG_APPLI,

  .iManufacturerCode      = FUOTA_FW_APP_MANUFACTURER_CODE,
  .iImageType             = FUOTA_FW_APP_IMAGE_TYPE,
  .lCurrentFileVersion    = FUOTA_FW_APP_FILE_VERSION,

  .eActivationPolicy      = ZCL_OTA_ACTIVATION_POLICY_SERVER,
  .eTimeOutPolicy         = ZCL_OTA_TIMEOUT_POLICY_APPLY_UPGRADE,

  .pCertPublicKey         = (uint8_t *)szCAPubKey,
  .iCertPublicSize        = CA_PUB_KEY_SIZE,

  .cEndpoint              = FUOTA_ENDPOINT,
  .iProfile               = FUOTA_PROFILE_ID,
  .iDeviceId              = FUOTA_DEVICE_ID,
};

/* USER CODE BEGIN PC */
/* Menu Lists */
static const AppMenuSentenceT szControlList[] = 
{
  { "Cooling only" },
  { "Cooling + Reheat" },
  { "Heating only" },
  { "Heating + Reheat" },
  { "Cooling and Heating" },
  { "Cooling and Heating + Reheat" },
};

static const AppMenuSentenceT szSysModeList[] = 
{
  { "OFF" },
  { "Auto" },
  { "Not Used" },
  { "Cooling" },
  { "Heating" },
  { "Ext Heating" },
  { "Pre-Cooling" },
  { "Fan" },
  { "Dry" },
  { "Sleep" },
}; 
   
