STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_Thermostat_Server_Router_OTA/STM32_WPAN/App/app_zigbee_endpoint.c
/* Description of Relay State/Play */
static const char szRelayState[2][8] = { "Open", "Close" };
static const char szRelayPlay[3][15] = { "", "for heating", "for cooling" };

/* Link Menu/Attributes */
static const enum ZbZclThermAttrT eMenuAttributesList[] = { ZCL_THERM_SVR_ATTR_OCCUP_COOL_SETPOINT, ZCL_THERM_SVR_ATTR_OCCUP_HEAT_SETPOINT,
                                                            ZCL_THERM_SVR_ATTR_CONTROL_SEQ_OPER, ZCL_THERM_SVR_ATTR_SYSTEM_MODE };

/* USER CODE END PC */

/* Private variables ---------------------------------------------------------*/
static bool                     bDownLoadServerFound;

/* USER CODE BEGIN PV */
static UTIL_TIMER_Object_t      stTimerSensorUpdate, stTimerMenuExit;

static uint8_t                  cRelayState, cRelayPlay;
static int16_t                  iTemperatureCurrent;
static int16_t                  iTemperatureCooling, iTemperatureHeating, iControlOper, iSysMode;
static AppMenuButtonsT          eUsedButton;

/* Description of Menu : MenuList, MenuName, List do display, linked variables, values min & max */
static const struct MenuButtonsT stMenuButtonList[] = 
{
  { "Menu Cooling", "Cooling Temp " , NULL,           &iTemperatureCooling, TEMP_MEASURED_MIN,                TEMP_MEASURED_MAX,  TEMP_TOLERANCE, TEMP_DISPLAY_SCALE },
  { "Menu Heating", "Heating Temp " , NULL,           &iTemperatureHeating, TEMP_MEASURED_MIN,                TEMP_MEASURED_MAX,  TEMP_TOLERANCE, TEMP_DISPLAY_SCALE },
  { "Menu Control", "Control: " ,     szControlList,  &iControlOper,        ZCL_THERM_CONTROL_OPERCOOL_ONLY,  ZCL_THERM_CONTROL_OPERCOOL_HEAT_REHEAT, 1, 1 },
  { "Menu SysMode", "SysMode: " ,     szSysModeList,  &iSysMode,            ZCL_THERM_SYSMODE_OFF,            ZCL_THERM_SYSMODE_SLEEP,                1, 1 },
  { APP_MENU_EXIT,  "" ,              NULL,           NULL,                 0,                                0,                  0,              0 },
};

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

/* Thermostat Server Callbacks */
static enum ZclStatusCodeT  APP_ZIGBEE_ThermostatServerGetRelayStatusLogCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclAddrInfoT * pstSrcInfo );

static struct ZbZclThermServerCallbacksT stThermostatServerCallbacks =
{
  .get_relay_status_log = APP_ZIGBEE_ThermostatServerGetRelayStatusLogCallback,
};

/* USER CODE BEGIN PFP */
static void APP_ZIGBEE_ApplicationTaskInit        ( void );
static void APP_ZIGBEE_ThermostatServerStart      ( void );
static void APP_ZIGBEE_TempSensorRead             ( void );
static void APP_ZIGBEE_MenuUpdate                 ( void );

static void APP_ZIGBEE_TimerSensorUpdateCallback  ( void * arg );
static void APP_ZIGBEE_TimerMenuExitCallback      ( void * arg );


/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_ApplicationInit(void)
{
  LOG_INFO_APP( "ZIGBEE Application Init" );

  /* Initialization of the Zigbee stack */
  APP_ZIGBEE_Init();

  /* Configure Application Form/Join parameters : Startup, Persistence and Start with/without Form/Join */
  stZigbeeAppInfo.eStartupControl = ZbStartTypeJoin;
  stZigbeeAppInfo.bPersistNotification = false;
  stZigbeeAppInfo.bNwkStartup = true;

  /* USER CODE BEGIN APP_ZIGBEE_ApplicationInit */
  /* Initialization of used Tasks */
  APP_ZIGBEE_ApplicationTaskInit();

  /* USER CODE END APP_ZIGBEE_ApplicationInit */

  /* Initialize Zigbee stack layers */
  APP_ZIGBEE_StackLayersInit();
}

/**
 * @brief  Zigbee application start
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_ApplicationStart( void )
{
  /* USER CODE BEGIN APP_ZIGBEE_ApplicationStart */
  /* Start Thermostat Server */
  APP_ZIGBEE_ThermostatServerStart();

  /* Display Short Address */
  LOG_INFO_APP( "Use Short Address : 0x%04X", ZbShortAddress( stZigbeeAppInfo.pstZigbee ) );
  LOG_INFO_APP( "%s ready to work !", APP_ZIGBEE_APPLICATION_NAME );


  /* Start periodic Temperaure Measure */
  UTIL_TIMER_Start( &stTimerSensorUpdate );

  /* USER CODE END APP_ZIGBEE_ApplicationStart */

  /* Verify if an OTA Server is found */
  bDownLoadServerFound = AppZbOtaClient_SearchOtaServer();
  if ( bDownLoadServerFound == false )
  {
    LOG_ERROR_APP( "OTA Server not found !" );
  }

#if ( CFG_LPM_LEVEL != 0)
  /* Authorize LowPower now */
  UTIL_LPM_SetMaxMode( 1 << CFG_LPM_APP, UTIL_LPM_MAX_MODE );
#endif /* CFG_LPM_LEVEL */
}

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_ConfigEndpoints(void)
{
  struct ZbApsmeAddEndpointReqT   stRequest;
  struct ZbApsmeAddEndpointConfT  stConfig;
  /* USER CODE BEGIN APP_ZIGBEE_ConfigEndpoints1 */

  /* USER CODE END APP_ZIGBEE_ConfigEndpoints1 */

  /* Add EndPoint */
  memset( &stRequest, 0, sizeof( stRequest ) );
  memset( &stConfig, 0, sizeof( stConfig ) );

  stRequest.profileId = APP_ZIGBEE_PROFILE_ID;
  stRequest.deviceId = APP_ZIGBEE_DEVICE_ID;
  stRequest.endpoint = APP_ZIGBEE_ENDPOINT;
  ZbZclAddEndpoint( stZigbeeAppInfo.pstZigbee, &stRequest, &stConfig );
  assert( stConfig.status == ZB_STATUS_SUCCESS );

  /* Add Thermostat Server Cluster */
  stZigbeeAppInfo.ThermostatServer = ZbZclThermServerAlloc( stZigbeeAppInfo.pstZigbee, APP_ZIGBEE_ENDPOINT, &stThermostatServerCallbacks, NULL );
  assert( stZigbeeAppInfo.ThermostatServer != NULL );
  if ( ZbZclClusterEndpointRegister( stZigbeeAppInfo.ThermostatServer ) == false )
  {
    LOG_ERROR_APP( "Error during Thermostat Server Endpoint Register." );
  }

  /* Init OTA EndPoint & Cluster  */
  if ( AppZbOtaClient_ClusterInit( stZigbeeAppInfo.pstZigbee, &stOtaClientInfo ) == false )
  {
    LOG_ERROR_APP( "Error during OTA Client Endpoint/Cluster Register." );
  }

  /* USER CODE BEGIN APP_ZIGBEE_ConfigEndpoints2 */

  /* USER CODE END APP_ZIGBEE_ConfigEndpoints2 */
}

/**
 * @brief  Set Group Addressing mode (if used)
 * @param  None
 * @retval 'true' if Group Address used else 'false'.
 */
bool APP_ZIGBEE_ConfigGroupAddr( void )
{
  struct ZbApsmeAddGroupReqT  stRequest;
  struct ZbApsmeAddGroupConfT stConfig;

  memset( &stRequest, 0, sizeof( stRequest ) );

  stRequest.endpt = APP_ZIGBEE_ENDPOINT;
  stRequest.groupAddr = APP_ZIGBEE_GROUP_ADDRESS;
  ZbApsmeAddGroupReq( stZigbeeAppInfo.pstZigbee, &stRequest, &stConfig );

