STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_Thermostat_Server_Router_OTA/STM32_WPAN/App/app_zigbee_endpoint.c
  return true;
}

/**
 * @brief  Return the Startup Configuration
 * @param  pstConfig  Configuration structure to fill
 * @retval None
 */
void APP_ZIGBEE_GetStartupConfig( struct ZbStartupT * pstConfig )
{
  /* Attempt to join a zigbee network */
  ZbStartupConfigGetProDefaults( pstConfig );

  /* Using the default HA preconfigured Link Key */
  memcpy( pstConfig->security.preconfiguredLinkKey, sec_key_ha, ZB_SEC_KEYSIZE );

  /* Setting up additional startup configuration parameters */
  pstConfig->startupControl = stZigbeeAppInfo.eStartupControl;
  pstConfig->channelList.count = 1;
  pstConfig->channelList.list[0].page = 0;
  pstConfig->channelList.list[0].channelMask = APP_ZIGBEE_CHANNEL_MASK;

  /* Set the TX-Power */
  if ( APP_ZIGBEE_SetTxPower( APP_ZIGBEE_TX_POWER ) == false )
  {
    LOG_ERROR_APP( "Switching to %d dB failed.", APP_ZIGBEE_TX_POWER );
    return;
  }

  /* USER CODE BEGIN APP_ZIGBEE_GetStartupConfig */

  /* USER CODE END APP_ZIGBEE_GetStartupConfig */
}

/**
 * @brief  Manage a New Device on Network (called only if Coord or Router).
 * @param  iShortAddress      Short Address of new Device
 * @param  dlExtendedAddress  Extended Address of new Device
 * @param  cCapability        Capability of new Device
 * @retval Group Address
 */
void APP_ZIGBEE_SetNewDevice( uint16_t iShortAddress, uint64_t dlExtendedAddress, uint8_t cCapability )
{
  LOG_INFO_APP( "New Device (%d) on Network : with Extended ( " LOG_DISPLAY64() " ) and Short ( 0x%04X ) Address.", cCapability, LOG_NUMBER64( dlExtendedAddress ), iShortAddress );

  /* USER CODE BEGIN APP_ZIGBEE_SetNewDevice */

  /* USER CODE END APP_ZIGBEE_SetNewDevice */
}

/**
 * @brief  Print application information to the console
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_PrintApplicationInfo(void)
{
  LOG_INFO_APP( "**********************************************************" );
  LOG_INFO_APP( "Network config : CENTRALIZED ROUTER" );

  /* USER CODE BEGIN APP_ZIGBEE_PrintApplicationInfo1 */
  LOG_INFO_APP( "Application Flashed Origin : Zigbee %s %s", APP_ZIGBEE_APPLICATION_NAME, APP_ZIGBEE_APPLICATION_OS_NAME );

  /* USER CODE END APP_ZIGBEE_PrintApplicationInfo1 */
  LOG_INFO_APP( "Channel used: %d.", APP_ZIGBEE_CHANNEL );

  APP_ZIGBEE_PrintGenericInfo();

  LOG_INFO_APP( "Clusters allocated are:" );
  LOG_INFO_APP( "  %s on Endpoint %d.", APP_ZIGBEE_CLUSTER_NAME, APP_ZIGBEE_ENDPOINT );
  LOG_INFO_APP( "  %s on Endpoint %d.", FUOTA_CLUSTER_NAME, FUOTA_ENDPOINT );

  /* USER CODE BEGIN APP_ZIGBEE_PrintApplicationInfo2 */

  /* USER CODE END APP_ZIGBEE_PrintApplicationInfo2 */

  LOG_INFO_APP( "**********************************************************" );
}

/**
 * @brief  Thermostat Server 'GetRelayStatusLog' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_ThermostatServerGetRelayStatusLogCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclAddrInfoT * pstSrcInfo )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_ThermostatServerGetRelayStatusLogCallback */

  /* USER CODE END APP_ZIGBEE_ThermostatServerGetRelayStatusLogCallback */
  return eStatus;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

/**
 * @brief  Zigbee application Task initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ApplicationTaskInit( void )
{
  /* Task that Update Temperature AttributeValue */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_ZIGBEE_APP_SENSOR_READ, UTIL_SEQ_RFU, APP_ZIGBEE_TempSensorRead );
  
  /* Task that Manage Menu */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_ZIGBEE_APP_MENU_UPDATE, UTIL_SEQ_RFU, APP_ZIGBEE_MenuUpdate );
  

  /* Create timer to exit of Menu after a TimeOut */
  UTIL_TIMER_Create( &stTimerSensorUpdate, TEMP_SENSOR_UPDATE_PERIOD, UTIL_TIMER_PERIODIC, APP_ZIGBEE_TimerSensorUpdateCallback, NULL );
  
  /* Create timer to get the measure of temperature sensor */
  UTIL_TIMER_Create( &stTimerMenuExit, MENU_TIME_TO_CHOICE_TIMEOUT, UTIL_TIMER_ONESHOT, APP_ZIGBEE_TimerMenuExitCallback, NULL );
}


/**
 * @brief  Start of Thermostat Server
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ThermostatServerStart( void )
{
  enum ZclStatusCodeT eStatus;
  int8_t   cTemp;
  int16_t  iTemperature;
  
  /* Normally, Read Temperature from sensor */
  
  /* Simulation of a Sensor. Start Temp in default Temp +/- 13 degrees Celsius */
  ZIGBEE_PLAT_RngGet( 1, (uint8_t *)&cTemp );
  iTemperature = TEMP_SIMU_START_DEFAULT + ( cTemp * 10 );
  
  /* Update default values for Thermostats. Diff between heating/cooling setpoint is 5 degrees Celsius and default mode is 'Auto'. */
  iTemperatureCurrent = iTemperature;
  iTemperatureCooling = TEMP_MEASURED_DEFAULT + 100;
  iTemperatureHeating = TEMP_MEASURED_DEFAULT - 400;
  iControlOper = ZCL_THERM_CONTROL_OPERCOOL_HEAT;
  iSysMode = ZCL_THERM_SYSMODE_AUTO;
  cRelayState = RELAY_STATE_OPEN;
  cRelayPlay = RELAY_NO_PLAY;
  
  /* Update Attributes */
  eStatus = ZbZclAttrIntegerWrite( stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_LOCAL_TEMP, iTemperatureCurrent );
  eStatus |= ZbZclAttrIntegerWrite( stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_OCCUP_COOL_SETPOINT, iTemperatureCooling );
  eStatus |= ZbZclAttrIntegerWrite( stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_OCCUP_HEAT_SETPOINT, iTemperatureHeating );
  eStatus |= ZbZclAttrIntegerWrite( stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_CONTROL_SEQ_OPER, iControlOper );
  eStatus |= ZbZclAttrIntegerWrite( stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_SYSTEM_MODE, iSysMode );
  if ( eStatus != ZCL_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "[THERMOSTAT] Error during an attribute write (0x%02X)", eStatus );
  }  
  
  /* Initialize Menu for Parameters */
  eUsedButton = MENU_BUTTON_NONE;
  APP_MENU_Init( (struct MenuButtonsT *) &stMenuButtonList );
}


/**
 * @brief  Management of the UpdateTimer Callback to launch a Temperature Read Task
 * @param  arg    Argument 
 * @retval None
 */
static void APP_ZIGBEE_TimerSensorUpdateCallback( void * arg )
{
  UTIL_SEQ_SetTask( 1u << CFG_TASK_ZIGBEE_APP_SENSOR_READ, TASK_ZIGBEE_APP_SENSOR_READ_PRIORITY );
}


/**
 * @brief  Exit of the Menu after a TimeOut
 * @param  arg    Argument 
 * @retval None
 */
static void APP_ZIGBEE_TimerMenuExitCallback( void * arg )
{
  eUsedButton = MENU_BUTTON_STOP;
  UTIL_SEQ_SetTask( 1u << CFG_TASK_ZIGBEE_APP_MENU_UPDATE, TASK_ZIGBEE_APP_MENU_UPDATE_PRIORITY );
}


/**
 * @brief  Management of the SW1 button. Play 'Enter' button of Menu.
 * @param  None
 * @retval None
 */
void APP_BSP_Button1Action(void)
{
  eUsedButton = MENU_BUTTON_ENTER;
  UTIL_SEQ_SetTask( 1u << CFG_TASK_ZIGBEE_APP_MENU_UPDATE, TASK_ZIGBEE_APP_MENU_UPDATE_PRIORITY );
}


/**
 * @brief  Management of the SW2 button. Play 'Low' button of Menu
 * @param  None
 * @retval None
 */
void APP_BSP_Button2Action(void)
{
  eUsedButton = MENU_BUTTON_ARROW_LOW;
  UTIL_SEQ_SetTask( 1u << CFG_TASK_ZIGBEE_APP_MENU_UPDATE, TASK_ZIGBEE_APP_MENU_UPDATE_PRIORITY );
}


/**
 * @brief  Management of the SW3 button. Play 'High' button of Menu
 * @param  None
 * @retval None
 */
void APP_BSP_Button3Action(void)
{
  eUsedButton = MENU_BUTTON_ARROW_HIGH;
  UTIL_SEQ_SetTask( 1u << CFG_TASK_ZIGBEE_APP_MENU_UPDATE, TASK_ZIGBEE_APP_MENU_UPDATE_PRIORITY );
}


/**
 * @brief   Management of all buttons for Menu.
 *          If a setting change, update related attribute.
 * @param   None
 * @retval  None
 */
static void APP_ZIGBEE_MenuUpdate( void )
{
  uint8_t             bChange;
  uint16_t            iIndexChange;
  int16_t             iValue;
  char                szText[10];
  enum ZclDataTypeT   eDataType;
  enum ZclStatusCodeT eStatus;
  
  // -- First Stop Timer  --
  UTIL_TIMER_Stop( &stTimerMenuExit );
  
