STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_Thermostat_Server_Router_OTA/STM32_WPAN/App/app_zigbee_endpoint.c
  switch( eUsedButton )
  {
    case MENU_BUTTON_ENTER :  
        bChange = APP_MENU_ButtonEnter( &iIndexChange );
        if ( bChange != FALSE )
        { 
          // -- Found the modified value -- */
          iValue = *(stMenuButtonList[iIndexChange].piOptionValue);
          
          // -- In all case, verify if TempCooling & TempHeating are good */
          if ( ( eMenuAttributesList[iIndexChange] == ZCL_THERM_SVR_ATTR_OCCUP_COOL_SETPOINT ) && ( iValue <= iTemperatureHeating ) )
          {
            sprintf(szText, "%d.%02d", ( iTemperatureHeating / TEMP_DISPLAY_SCALE ),  (uint8_t)( iTemperatureHeating % TEMP_DISPLAY_SCALE ) );
            LOG_ERROR_APP( "ERROR : 'Cooling Temp' setpoint need to be more than 'Heating Temp' setpoint (%s C)", szText );
            iTemperatureCooling = (int16_t) ZbZclAttrIntegerRead(stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_OCCUP_COOL_SETPOINT, &eDataType , &eStatus );
          }
          else
          {
            if ( ( eMenuAttributesList[iIndexChange] == ZCL_THERM_SVR_ATTR_OCCUP_HEAT_SETPOINT ) && ( iValue >= iTemperatureCooling ) )
            {
              sprintf(szText, "%d.%02d", ( iTemperatureCooling / TEMP_DISPLAY_SCALE ),  (uint8_t)( iTemperatureCooling % TEMP_DISPLAY_SCALE ) );
              LOG_ERROR_APP( "ERROR : 'Heating Temp' setpoint need to be less than 'Cooling Temp' setpoint (%s C)", szText );
              iTemperatureHeating = (int16_t) ZbZclAttrIntegerRead(stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_OCCUP_HEAT_SETPOINT, &eDataType , &eStatus );
            }
            else
            {
              // -- Save the modified value -- */
              eStatus = ZbZclAttrIntegerWrite( stZigbeeAppInfo.ThermostatServer, eMenuAttributesList[iIndexChange], iValue );
              if ( eStatus != ZCL_STATUS_SUCCESS )
              {
                LOG_ERROR_APP( "[THERMOSTAT] Error during an attribute write (0x%02X)", eStatus );
              }
            }
          }
        }
        else
        {
          UTIL_TIMER_Start( &stTimerMenuExit );
        }
        break;
                              
    case MENU_BUTTON_ARROW_LOW: 
        APP_MENU_ButtonArrowLow();
        UTIL_TIMER_Start( &stTimerMenuExit );
        break;
        
    case MENU_BUTTON_ARROW_HIGH: 
        APP_MENU_ButtonArrowHigh();
        UTIL_TIMER_Start( &stTimerMenuExit );
        break;
        
    case MENU_BUTTON_STOP:
        APP_MENU_ButtonStop();
        break;
        
    default :
        break;
  }
        
  eUsedButton = MENU_BUTTON_NONE;
}


/**
 * @brief  Generate a new temperature based on random variation
 * @param  iTempIncrement   Current Temperaturure increment
 * @retval None
 */
static void APP_ZIGBEE_TempSensorGenerateRandom( int16_t iTempIncrement )
{
  uint8_t             cTempVariation; 
  
  ZIGBEE_PLAT_RngGet( 1, &cTempVariation );
  if ( cTempVariation > 128 )
  { 
    iTemperatureCurrent += iTempIncrement; 
    if ( iTemperatureCurrent > TEMP_MEASURED_MAX )
    { 
      iTemperatureCurrent = TEMP_MEASURED_MAX; 
    }
  }
  else
  { 
    iTemperatureCurrent -= iTempIncrement; 
    if ( iTemperatureCurrent < TEMP_MEASURED_MIN )
    { 
      iTemperatureCurrent = TEMP_MEASURED_MIN; 
    }
  }
}

/**
 * @brief  Write locally temp meas attribute 
 * @param  sensor read temp value
 * @retval None
 */
static void APP_ZIGBEE_TempSensorRead( void )
{
  int16_t             iTempIncrement = 0;
  enum ZclStatusCodeT eStatus;
  char                szText[10];
  static uint16_t     iTempInertia = TEMP_INERTIA;
  
  /* Normally, Read Temperature from sensor */
  
  /* Simulation of a Sensor */
  
  /* Simulate Temperature Inertia */
  if ( --iTempInertia == 0x00 )
  { 
    iTempInertia = TEMP_INERTIA;
    iTempIncrement = TEMP_SIMU_INCREMENT;
  }
    
  /* Update Temperature in function of Thermostat state */
  switch ( iSysMode )
  {
    case ZCL_THERM_SYSMODE_COOL :
    case ZCL_THERM_SYSMODE_PRECOOL :
    case ZCL_THERM_SYSMODE_FAN :
        if ( iTemperatureCurrent > iTemperatureCooling )
        {
          iTemperatureCurrent -= iTempIncrement;
          cRelayState = RELAY_STATE_CLOSE;
          cRelayPlay = RELAY_PLAY_COOLING;
        }
        else
        { 
          cRelayState = RELAY_STATE_OPEN;
          cRelayPlay = RELAY_NO_PLAY;
          iTemperatureCurrent += iTempIncrement;
        }
        break;
      
    case ZCL_THERM_SYSMODE_HEAT :
    case ZCL_THERM_SYSMODE_EHEAT :
    case ZCL_THERM_SYSMODE_DRY :
        if ( iTemperatureCurrent < iTemperatureHeating )
        {
          iTemperatureCurrent += iTempIncrement;
          cRelayState = RELAY_STATE_CLOSE;
          cRelayPlay = RELAY_PLAY_HEATING;
        }
        else
        {
          cRelayState = RELAY_STATE_OPEN;
          cRelayPlay = RELAY_NO_PLAY;
          iTemperatureCurrent -= iTempIncrement;
        }
        break;
          
    case ZCL_THERM_SYSMODE_AUTO :
        if ( iTemperatureCurrent < iTemperatureHeating )
        {
          iTemperatureCurrent += iTempIncrement;
          cRelayState = RELAY_STATE_CLOSE;
          cRelayPlay = RELAY_PLAY_HEATING;
        }
        else
        {
          if ( iTemperatureCurrent > iTemperatureCooling )
          {
            iTemperatureCurrent -= iTempIncrement;
            cRelayState = RELAY_STATE_CLOSE;
            cRelayPlay = RELAY_PLAY_COOLING;
          }
          else
          {
            APP_ZIGBEE_TempSensorGenerateRandom( iTempIncrement );
            cRelayState = RELAY_STATE_OPEN;
            cRelayPlay = RELAY_NO_PLAY;
          }
        }
        break;
        
    default : 
        APP_ZIGBEE_TempSensorGenerateRandom( iTempIncrement );
        break;
  }  
  
  /* Display (if not Menu On) & Save Updated Temperature */
  if ( APP_MENU_IsMenuDisplayed() == FALSE )
  {
    sprintf(szText, "%d.%02d", ( iTemperatureCurrent / TEMP_DISPLAY_SCALE ),  (uint8_t)( iTemperatureCurrent % TEMP_DISPLAY_SCALE ) );
    LOG_INFO_APP( "[THERMOSTAT] Update TempMeasure : %s C and Relay is : %s %s", szText, szRelayState[cRelayState], szRelayPlay[cRelayPlay] );
    
  }
  
  eStatus = ZbZclAttrIntegerWrite( stZigbeeAppInfo.ThermostatServer, ZCL_THERM_SVR_ATTR_LOCAL_TEMP, iTemperatureCurrent);
  if ( eStatus != ZCL_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "[THERMOSTAT] Error during 'Local Temp' attribute write (0x%02X)", eStatus );
  }
}


/* USER CODE END FD_LOCAL_FUNCTIONS */
